grevaillot/svd_tools/headers/STM32F7x/otg_fs_device.h
#pragma once 

/* --- OTG_FS_DEVICE: USB on the go full speed ---------------------- */

/** @defgroup otg_fs_device_registers USB on the go full speed Register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DCFG OTG_FS device configuration register (OTG_FS_DCFG) **/
#define OTG_FS_DEVICE_OTG_FS_DCFG			MMIO32(OTG_FS_DEVICE_BASE + 0x00)
/** OTG_FS_DEVICE_OTG_FS_DCTL OTG_FS device control register (OTG_FS_DCTL) **/
#define OTG_FS_DEVICE_OTG_FS_DCTL			MMIO32(OTG_FS_DEVICE_BASE + 0x04)
/** OTG_FS_DEVICE_OTG_FS_DSTS OTG_FS device status register (OTG_FS_DSTS) **/
#define OTG_FS_DEVICE_OTG_FS_DSTS			MMIO32(OTG_FS_DEVICE_BASE + 0x08)
/** OTG_FS_DEVICE_OTG_FS_DIEPMSK OTG_FS device IN endpoint common interrupt mask register (OTG_FS_DIEPMSK) **/
#define OTG_FS_DEVICE_OTG_FS_DIEPMSK			MMIO32(OTG_FS_DEVICE_BASE + 0x10)
/** OTG_FS_DEVICE_OTG_FS_DOEPMSK OTG_FS device OUT endpoint common interrupt mask register (OTG_FS_DOEPMSK) **/
#define OTG_FS_DEVICE_OTG_FS_DOEPMSK			MMIO32(OTG_FS_DEVICE_BASE + 0x14)
/** OTG_FS_DEVICE_OTG_FS_DAINT OTG_FS device all endpoints interrupt register (OTG_FS_DAINT) **/
#define OTG_FS_DEVICE_OTG_FS_DAINT			MMIO32(OTG_FS_DEVICE_BASE + 0x18)
/** OTG_FS_DEVICE_OTG_FS_DAINTMSK OTG_FS all endpoints interrupt mask register (OTG_FS_DAINTMSK) **/
#define OTG_FS_DEVICE_OTG_FS_DAINTMSK			MMIO32(OTG_FS_DEVICE_BASE + 0x1c)
/** OTG_FS_DEVICE_OTG_FS_DVBUSDIS OTG_FS device VBUS discharge time register **/
#define OTG_FS_DEVICE_OTG_FS_DVBUSDIS			MMIO32(OTG_FS_DEVICE_BASE + 0x28)
/** OTG_FS_DEVICE_OTG_FS_DVBUSPULSE OTG_FS device VBUS pulsing time register **/
#define OTG_FS_DEVICE_OTG_FS_DVBUSPULSE			MMIO32(OTG_FS_DEVICE_BASE + 0x2c)
/** OTG_FS_DEVICE_OTG_FS_DIEPEMPMSK OTG_FS device IN endpoint FIFO empty interrupt mask register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPEMPMSK			MMIO32(OTG_FS_DEVICE_BASE + 0x34)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL0 OTG_FS device control IN endpoint 0 control register (OTG_FS_DIEPCTL0) **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0			MMIO32(OTG_FS_DEVICE_BASE + 0x100)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT0 device endpoint-x interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT0			MMIO32(OTG_FS_DEVICE_BASE + 0x108)
/** OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0 device endpoint-0 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0			MMIO32(OTG_FS_DEVICE_BASE + 0x110)
/** OTG_FS_DEVICE_OTG_FS_DTXFSTS0 OTG_FS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS0			MMIO32(OTG_FS_DEVICE_BASE + 0x118)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1 OTG device endpoint-1 control register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1			MMIO32(OTG_FS_DEVICE_BASE + 0x120)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT1 device endpoint-1 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT1			MMIO32(OTG_FS_DEVICE_BASE + 0x128)
/** OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1 device endpoint-1 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1			MMIO32(OTG_FS_DEVICE_BASE + 0x130)
/** OTG_FS_DEVICE_OTG_FS_DTXFSTS1 OTG_FS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS1			MMIO32(OTG_FS_DEVICE_BASE + 0x138)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2 OTG device endpoint-2 control register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2			MMIO32(OTG_FS_DEVICE_BASE + 0x140)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT2 device endpoint-2 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT2			MMIO32(OTG_FS_DEVICE_BASE + 0x148)
/** OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2 device endpoint-2 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2			MMIO32(OTG_FS_DEVICE_BASE + 0x150)
/** OTG_FS_DEVICE_OTG_FS_DTXFSTS2 OTG_FS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS2			MMIO32(OTG_FS_DEVICE_BASE + 0x158)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL3 OTG device endpoint-3 control register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL3			MMIO32(OTG_FS_DEVICE_BASE + 0x160)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT3 device endpoint-3 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT3			MMIO32(OTG_FS_DEVICE_BASE + 0x168)
/** OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3 device endpoint-3 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ3			MMIO32(OTG_FS_DEVICE_BASE + 0x170)
/** OTG_FS_DEVICE_OTG_FS_DTXFSTS3 OTG_FS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS3			MMIO32(OTG_FS_DEVICE_BASE + 0x178)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL4 OTG device endpoint-4 control register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL4			MMIO32(OTG_FS_DEVICE_BASE + 0x180)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT4 device endpoint-4 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT4			MMIO32(OTG_FS_DEVICE_BASE + 0x188)
/** OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4 device endpoint-4 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4			MMIO32(OTG_FS_DEVICE_BASE + 0x194)
/** OTG_FS_DEVICE_OTG_FS_DTXFSTS4 OTG_FS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS4			MMIO32(OTG_FS_DEVICE_BASE + 0x19c)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5 OTG device endpoint-5 control register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5			MMIO32(OTG_FS_DEVICE_BASE + 0x1a0)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT5 device endpoint-5 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT5			MMIO32(OTG_FS_DEVICE_BASE + 0x1a8)
/** OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55 device endpoint-5 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55			MMIO32(OTG_FS_DEVICE_BASE + 0x1b0)
/** OTG_FS_DEVICE_OTG_FS_DTXFSTS55 OTG_FS device IN endpoint transmit FIFO status register **/
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS55			MMIO32(OTG_FS_DEVICE_BASE + 0x1b8)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL0 device endpoint-0 control register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0			MMIO32(OTG_FS_DEVICE_BASE + 0x300)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT0 device endpoint-0 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT0			MMIO32(OTG_FS_DEVICE_BASE + 0x308)
/** OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0 device OUT endpoint-0 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0			MMIO32(OTG_FS_DEVICE_BASE + 0x310)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL1 device endpoint-1 control register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL1			MMIO32(OTG_FS_DEVICE_BASE + 0x320)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT1 device endpoint-1 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT1			MMIO32(OTG_FS_DEVICE_BASE + 0x328)
/** OTG_FS_DEVICE_OTG_FS_DOEPTSIZ1 device OUT endpoint-1 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ1			MMIO32(OTG_FS_DEVICE_BASE + 0x330)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL2 device endpoint-2 control register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL2			MMIO32(OTG_FS_DEVICE_BASE + 0x340)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT2 device endpoint-2 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT2			MMIO32(OTG_FS_DEVICE_BASE + 0x348)
/** OTG_FS_DEVICE_OTG_FS_DOEPTSIZ2 device OUT endpoint-2 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ2			MMIO32(OTG_FS_DEVICE_BASE + 0x350)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL3 device endpoint-3 control register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL3			MMIO32(OTG_FS_DEVICE_BASE + 0x360)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT3 device endpoint-3 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT3			MMIO32(OTG_FS_DEVICE_BASE + 0x368)
/** OTG_FS_DEVICE_OTG_FS_DOEPTSIZ3 device OUT endpoint-3 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ3			MMIO32(OTG_FS_DEVICE_BASE + 0x370)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4 device endpoint-4 control register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4			MMIO32(OTG_FS_DEVICE_BASE + 0x378)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT4 device endpoint-4 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT4			MMIO32(OTG_FS_DEVICE_BASE + 0x380)
/** OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4 device OUT endpoint-4 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4			MMIO32(OTG_FS_DEVICE_BASE + 0x388)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5 device endpoint-5 control register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5			MMIO32(OTG_FS_DEVICE_BASE + 0x390)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT5 device endpoint-5 interrupt register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT5			MMIO32(OTG_FS_DEVICE_BASE + 0x398)
/** OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5 device OUT endpoint-5 transfer size register **/
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5			MMIO32(OTG_FS_DEVICE_BASE + 0x3a0)

/**@}*/


/** @defgroup otg_fs_device_otg_fs_dcfg OTGFSDCFG OTG_FS device configuration register (OTG_FS_DCFG)
@{*/


#define OTG_FS_DEVICE_OTG_FS_DCFG_PFIVL_SHIFT		11
#define OTG_FS_DEVICE_OTG_FS_DCFG_PFIVL_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_dcfg_pfivl PFIVL Periodic frame interval
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DCFG_DAD_SHIFT		4
#define OTG_FS_DEVICE_OTG_FS_DCFG_DAD_MASK		0x7f
/** @defgroup otg_fs_device_otg_fs_dcfg_dad DAD Device address
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DCFG_NZLSOHSK Non-zero-length status OUT handshake **/
#define OTG_FS_DEVICE_OTG_FS_DCFG_NZLSOHSK		(1 << 2)

#define OTG_FS_DEVICE_OTG_FS_DCFG_DSPD_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DCFG_DSPD_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_dcfg_dspd DSPD Device speed
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_dctl OTGFSDCTL OTG_FS device control register (OTG_FS_DCTL)
@{*/

/** OTG_FS_DEVICE_OTG_FS_DCTL_POPRGDNE Power-on programming done **/
#define OTG_FS_DEVICE_OTG_FS_DCTL_POPRGDNE		(1 << 11)
/** OTG_FS_DEVICE_OTG_FS_DCTL_CGONAK Clear global OUT NAK **/
#define OTG_FS_DEVICE_OTG_FS_DCTL_CGONAK		(1 << 10)
/** OTG_FS_DEVICE_OTG_FS_DCTL_SGONAK Set global OUT NAK **/
#define OTG_FS_DEVICE_OTG_FS_DCTL_SGONAK		(1 << 9)
/** OTG_FS_DEVICE_OTG_FS_DCTL_CGINAK Clear global IN NAK **/
#define OTG_FS_DEVICE_OTG_FS_DCTL_CGINAK		(1 << 8)
/** OTG_FS_DEVICE_OTG_FS_DCTL_SGINAK Set global IN NAK **/
#define OTG_FS_DEVICE_OTG_FS_DCTL_SGINAK		(1 << 7)

#define OTG_FS_DEVICE_OTG_FS_DCTL_TCTL_SHIFT		4
#define OTG_FS_DEVICE_OTG_FS_DCTL_TCTL_MASK		0x07
/** @defgroup otg_fs_device_otg_fs_dctl_tctl TCTL Test control
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DCTL_GONSTS Global OUT NAK status **/
#define OTG_FS_DEVICE_OTG_FS_DCTL_GONSTS		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DCTL_GINSTS Global IN NAK status **/
#define OTG_FS_DEVICE_OTG_FS_DCTL_GINSTS		(1 << 2)
/** OTG_FS_DEVICE_OTG_FS_DCTL_SDIS Soft disconnect **/
#define OTG_FS_DEVICE_OTG_FS_DCTL_SDIS		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DCTL_RWUSIG Remote wakeup signaling **/
#define OTG_FS_DEVICE_OTG_FS_DCTL_RWUSIG		(1 << 0)

/**@}*/

