grevaillot/svd_tools/headers/STM32F7x/otg_fs_device.h
/** @defgroup otg_fs_device_otg_fs_dsts OTGFSDSTS OTG_FS device status register (OTG_FS_DSTS)
@{*/


#define OTG_FS_DEVICE_OTG_FS_DSTS_FNSOF_SHIFT		8
#define OTG_FS_DEVICE_OTG_FS_DSTS_FNSOF_MASK		0x3fff
/** @defgroup otg_fs_device_otg_fs_dsts_fnsof FNSOF Frame number of the received SOF
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DSTS_EERR Erratic error **/
#define OTG_FS_DEVICE_OTG_FS_DSTS_EERR		(1 << 3)

#define OTG_FS_DEVICE_OTG_FS_DSTS_ENUMSPD_SHIFT		1
#define OTG_FS_DEVICE_OTG_FS_DSTS_ENUMSPD_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_dsts_enumspd ENUMSPD Enumerated speed
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DSTS_SUSPSTS Suspend status **/
#define OTG_FS_DEVICE_OTG_FS_DSTS_SUSPSTS		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepmsk OTGFSDIEPMSK OTG_FS device IN endpoint common interrupt mask register (OTG_FS_DIEPMSK)
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPMSK_INEPNEM IN endpoint NAK effective mask **/
#define OTG_FS_DEVICE_OTG_FS_DIEPMSK_INEPNEM		(1 << 6)
/** OTG_FS_DEVICE_OTG_FS_DIEPMSK_INEPNMM IN token received with EP mismatch mask **/
#define OTG_FS_DEVICE_OTG_FS_DIEPMSK_INEPNMM		(1 << 5)
/** OTG_FS_DEVICE_OTG_FS_DIEPMSK_ITTXFEMSK IN token received when TxFIFO empty mask **/
#define OTG_FS_DEVICE_OTG_FS_DIEPMSK_ITTXFEMSK		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DIEPMSK_TOM Timeout condition mask (Non-isochronous endpoints) **/
#define OTG_FS_DEVICE_OTG_FS_DIEPMSK_TOM		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DIEPMSK_EPDM Endpoint disabled interrupt mask **/
#define OTG_FS_DEVICE_OTG_FS_DIEPMSK_EPDM		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DIEPMSK_XFRCM Transfer completed interrupt mask **/
#define OTG_FS_DEVICE_OTG_FS_DIEPMSK_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_doepmsk OTGFSDOEPMSK OTG_FS device OUT endpoint common interrupt mask register (OTG_FS_DOEPMSK)
@{*/

/** OTG_FS_DEVICE_OTG_FS_DOEPMSK_OTEPDM OUT token received when endpoint disabled mask **/
#define OTG_FS_DEVICE_OTG_FS_DOEPMSK_OTEPDM		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DOEPMSK_STUPM SETUP phase done mask **/
#define OTG_FS_DEVICE_OTG_FS_DOEPMSK_STUPM		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DOEPMSK_EPDM Endpoint disabled interrupt mask **/
#define OTG_FS_DEVICE_OTG_FS_DOEPMSK_EPDM		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DOEPMSK_XFRCM Transfer completed interrupt mask **/
#define OTG_FS_DEVICE_OTG_FS_DOEPMSK_XFRCM		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_daint OTGFSDAINT OTG_FS device all endpoints interrupt register (OTG_FS_DAINT)
@{*/


#define OTG_FS_DEVICE_OTG_FS_DAINT_OEPINT_SHIFT		16
#define OTG_FS_DEVICE_OTG_FS_DAINT_OEPINT_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_daint_oepint OEPINT OUT endpoint interrupt bits
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DAINT_IEPINT_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DAINT_IEPINT_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_daint_iepint IEPINT IN endpoint interrupt bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_daintmsk OTGFSDAINTMSK OTG_FS all endpoints interrupt mask register (OTG_FS_DAINTMSK)
@{*/


#define OTG_FS_DEVICE_OTG_FS_DAINTMSK_OEPINT_SHIFT		16
#define OTG_FS_DEVICE_OTG_FS_DAINTMSK_OEPINT_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_daintmsk_oepint OEPINT OUT endpoint interrupt bits
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DAINTMSK_IEPM_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DAINTMSK_IEPM_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_daintmsk_iepm IEPM IN EP interrupt mask bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_dvbusdis OTGFSDVBUSDIS OTG_FS device VBUS discharge time register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DVBUSDIS_VBUSDT_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DVBUSDIS_VBUSDT_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_dvbusdis_vbusdt VBUSDT Device VBUS discharge time
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_dvbuspulse OTGFSDVBUSPULSE OTG_FS device VBUS pulsing time register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DVBUSPULSE_DVBUSP_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DVBUSPULSE_DVBUSP_MASK		0xfff
/** @defgroup otg_fs_device_otg_fs_dvbuspulse_dvbusp DVBUSP Device VBUS pulsing time
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepempmsk OTGFSDIEPEMPMSK OTG_FS device IN endpoint FIFO empty interrupt mask register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DIEPEMPMSK_INEPTXFEM_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPEMPMSK_INEPTXFEM_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_diepempmsk_ineptxfem INEPTXFEM IN EP Tx FIFO empty interrupt mask bits
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepctl0 OTGFSDIEPCTL0 OTG_FS device control IN endpoint 0 control register (OTG_FS_DIEPCTL0)
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL0_EPENA Endpoint enable **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL0_EPDIS Endpoint disable **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL0_SNAK Set NAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL0_CNAK Clear NAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_CNAK		(1 << 26)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_otg_fs_diepctl0_txfnum TXFNUM TxFIFO number
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL0_STALL STALL handshake **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_STALL		(1 << 21)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_diepctl0_eptyp EPTYP Endpoint type
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL0_NAKSTS NAK status **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL0_USBAEP USB active endpoint **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL0_MPSIZ_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_diepctl0_mpsiz MPSIZ Maximum packet size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepint0 OTGFSDIEPINT0 device endpoint-x interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPINT0_TXFE TXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT0_TXFE		(1 << 7)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT0_INEPNE INEPNE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT0_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT0_ITTXFE ITTXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT0_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT0_TOC TOC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT0_TOC		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT0_EPDISD EPDISD **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT0_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT0_XFRC XFRC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_dieptsiz0 OTGFSDIEPTSIZ0 device endpoint-0 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0_PKTCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_dieptsiz0_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ0_XFRSIZ_MASK		0x7f
/** @defgroup otg_fs_device_otg_fs_dieptsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_dtxfsts0 OTGFSDTXFSTS0 OTG_FS device IN endpoint transmit FIFO status register
@{*/


