grevaillot/svd_tools/headers/STM32F7x/otg_fs_device.h
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS0_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS0_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_dtxfsts0_ineptfsav INEPTFSAV IN endpoint TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepctl1 OTGFSDIEPCTL1 OTG device endpoint-1 control register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EPENA EPENA **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EPDIS EPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1_SODDFRM_SD1PID SODDFRM/SD1PID **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_SODDFRM_SD1PID		(1 << 29)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1_SNAK SNAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1_CNAK CNAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_CNAK		(1 << 26)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_otg_fs_diepctl1_txfnum TXFNUM TXFNUM
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1_Stall Stall **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_Stall		(1 << 21)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_diepctl1_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL1_USBAEP USBAEP **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL1_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_fs_diepctl1_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepint1 OTGFSDIEPINT1 device endpoint-1 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPINT1_TXFE TXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT1_TXFE		(1 << 7)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT1_INEPNE INEPNE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT1_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT1_ITTXFE ITTXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT1_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT1_TOC TOC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT1_TOC		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT1_EPDISD EPDISD **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT1_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT1_XFRC XFRC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT1_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_dieptsiz1 OTGFSDIEPTSIZ1 device endpoint-1 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1_MCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1_MCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_dieptsiz1_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_fs_dieptsiz1_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ1_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_fs_dieptsiz1_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_dtxfsts1 OTGFSDTXFSTS1 OTG_FS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DTXFSTS1_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS1_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_dtxfsts1_ineptfsav INEPTFSAV IN endpoint TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepctl2 OTGFSDIEPCTL2 OTG device endpoint-2 control register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EPENA EPENA **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EPDIS EPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2_SODDFRM SODDFRM **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2_SNAK SNAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2_CNAK CNAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_CNAK		(1 << 26)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_otg_fs_diepctl2_txfnum TXFNUM TXFNUM
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2_Stall Stall **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_Stall		(1 << 21)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_diepctl2_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL2_USBAEP USBAEP **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL2_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_fs_diepctl2_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepint2 OTGFSDIEPINT2 device endpoint-2 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPINT2_TXFE TXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT2_TXFE		(1 << 7)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT2_INEPNE INEPNE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT2_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT2_ITTXFE ITTXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT2_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT2_TOC TOC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT2_TOC		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT2_EPDISD EPDISD **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT2_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT2_XFRC XFRC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT2_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_dieptsiz2 OTGFSDIEPTSIZ2 device endpoint-2 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2_MCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2_MCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_dieptsiz2_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ2_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_fs_dieptsiz2_pktcnt PKTCNT Packet count
@{*/
/**@}*/


