grevaillot/svd_tools/headers/STM32F7x/otg_fs_device.h
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_fs_dieptsiz4_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ4_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_fs_dieptsiz4_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_dtxfsts4 OTGFSDTXFSTS4 OTG_FS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DTXFSTS4_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS4_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_dtxfsts4_ineptfsav INEPTFSAV IN endpoint TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepctl5 OTGFSDIEPCTL5 OTG device endpoint-5 control register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EPENA EPENA **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EPDIS EPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5_SODDFRM SODDFRM **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5_SNAK SNAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5_CNAK CNAK **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_CNAK		(1 << 26)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_TXFNUM_SHIFT		22
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_TXFNUM_MASK		0x0f
/** @defgroup otg_fs_device_otg_fs_diepctl5_txfnum TXFNUM TXFNUM
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5_Stall Stall **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_Stall		(1 << 21)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_diepctl5_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_FS_DIEPCTL5_USBAEP USBAEP **/
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPCTL5_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_fs_diepctl5_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_diepint5 OTGFSDIEPINT5 device endpoint-5 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DIEPINT5_TXFE TXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT5_TXFE		(1 << 7)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT5_INEPNE INEPNE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT5_INEPNE		(1 << 6)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT5_ITTXFE ITTXFE **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT5_ITTXFE		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT5_TOC TOC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT5_TOC		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT5_EPDISD EPDISD **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT5_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DIEPINT5_XFRC XFRC **/
#define OTG_FS_DEVICE_OTG_FS_DIEPINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_dieptsiz55 OTGFSDIEPTSIZ55 device endpoint-5 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55_MCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55_MCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_dieptsiz55_mcnt MCNT Multi count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_fs_dieptsiz55_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DIEPTSIZ55_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_fs_dieptsiz55_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_dtxfsts55 OTGFSDTXFSTS55 OTG_FS device IN endpoint transmit FIFO status register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DTXFSTS55_INEPTFSAV_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DTXFSTS55_INEPTFSAV_MASK		0xffff
/** @defgroup otg_fs_device_otg_fs_dtxfsts55_ineptfsav INEPTFSAV IN endpoint TxFIFO space available
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_doepctl0 OTGFSDOEPCTL0 device endpoint-0 control register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DOEPCTL0_EPENA EPENA **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL0_EPDIS EPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL0_SNAK SNAK **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL0_CNAK CNAK **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_CNAK		(1 << 26)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL0_Stall Stall **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_Stall		(1 << 21)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL0_SNPM SNPM **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_SNPM		(1 << 20)

#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_doepctl0_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DOEPCTL0_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL0_USBAEP USBAEP **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL0_MPSIZ_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_doepctl0_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_doepint0 OTGFSDOEPINT0 device endpoint-0 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DOEPINT0_B2BSTUP B2BSTUP **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT0_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT0_OTEPDIS OTEPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT0_OTEPDIS		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT0_STUP STUP **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT0_STUP		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT0_EPDISD EPDISD **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT0_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT0_XFRC XFRC **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT0_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_doeptsiz0 OTGFSDOEPTSIZ0 device OUT endpoint-0 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_doeptsiz0_stupcnt STUPCNT SETUP packet count
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0_PKTCNT Packet count **/
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0_PKTCNT		(1 << 19)

#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ0_XFRSIZ_MASK		0x7f
/** @defgroup otg_fs_device_otg_fs_doeptsiz0_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

