grevaillot/svd_tools/headers/STM32F7x/otg_fs_device.h
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EPENA EPENA **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EPDIS EPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SODDFRM SODDFRM **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SNAK SNAK **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_CNAK CNAK **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_CNAK		(1 << 26)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_Stall Stall **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_Stall		(1 << 21)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SNPM SNPM **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_SNPM		(1 << 20)

#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_doepctl4_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL4_USBAEP USBAEP **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL4_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_fs_doepctl4_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_doepint4 OTGFSDOEPINT4 device endpoint-4 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DOEPINT4_B2BSTUP B2BSTUP **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT4_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT4_OTEPDIS OTEPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT4_OTEPDIS		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT4_STUP STUP **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT4_STUP		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT4_EPDISD EPDISD **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT4_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT4_XFRC XFRC **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT4_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_doeptsiz4 OTGFSDOEPTSIZ4 device OUT endpoint-4 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4_RXDPID_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_doeptsiz4_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_fs_doeptsiz4_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ4_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_fs_doeptsiz4_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_doepctl5 OTGFSDOEPCTL5 device endpoint-5 control register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EPENA EPENA **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EPENA		(1 << 31)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EPDIS EPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EPDIS		(1 << 30)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SODDFRM SODDFRM **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SODDFRM		(1 << 29)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SD0PID_SEVNFRM SD0PID/SEVNFRM **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SD0PID_SEVNFRM		(1 << 28)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SNAK SNAK **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SNAK		(1 << 27)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_CNAK CNAK **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_CNAK		(1 << 26)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_Stall Stall **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_Stall		(1 << 21)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SNPM SNPM **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_SNPM		(1 << 20)

#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EPTYP_SHIFT		18
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EPTYP_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_doepctl5_eptyp EPTYP EPTYP
@{*/
/**@}*/

/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_NAKSTS NAKSTS **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_NAKSTS		(1 << 17)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EONUM_DPID EONUM/DPID **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_EONUM_DPID		(1 << 16)
/** OTG_FS_DEVICE_OTG_FS_DOEPCTL5_USBAEP USBAEP **/
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_USBAEP		(1 << 15)

#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_MPSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DOEPCTL5_MPSIZ_MASK		0x7ff
/** @defgroup otg_fs_device_otg_fs_doepctl5_mpsiz MPSIZ MPSIZ
@{*/
/**@}*/


/**@}*/

/** @defgroup otg_fs_device_otg_fs_doepint5 OTGFSDOEPINT5 device endpoint-5 interrupt register
@{*/

/** OTG_FS_DEVICE_OTG_FS_DOEPINT5_B2BSTUP B2BSTUP **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT5_B2BSTUP		(1 << 6)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT5_OTEPDIS OTEPDIS **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT5_OTEPDIS		(1 << 4)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT5_STUP STUP **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT5_STUP		(1 << 3)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT5_EPDISD EPDISD **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT5_EPDISD		(1 << 1)
/** OTG_FS_DEVICE_OTG_FS_DOEPINT5_XFRC XFRC **/
#define OTG_FS_DEVICE_OTG_FS_DOEPINT5_XFRC		(1 << 0)

/**@}*/

/** @defgroup otg_fs_device_otg_fs_doeptsiz5 OTGFSDOEPTSIZ5 device OUT endpoint-5 transfer size register
@{*/


#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5_RXDPID_STUPCNT_SHIFT		29
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5_RXDPID_STUPCNT_MASK		0x03
/** @defgroup otg_fs_device_otg_fs_doeptsiz5_rxdpid_stupcnt RXDPIDSTUPCNT Received data PID/SETUP packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5_PKTCNT_SHIFT		19
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5_PKTCNT_MASK		0x3ff
/** @defgroup otg_fs_device_otg_fs_doeptsiz5_pktcnt PKTCNT Packet count
@{*/
/**@}*/


#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5_XFRSIZ_SHIFT		0
#define OTG_FS_DEVICE_OTG_FS_DOEPTSIZ5_XFRSIZ_MASK		0x7ffff
/** @defgroup otg_fs_device_otg_fs_doeptsiz5_xfrsiz XFRSIZ Transfer size
@{*/
/**@}*/


/**@}*/
